Catalogs/АР_ШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>АР_ШаблоныДокументов</Name>
			<Comment>Шаблоны документов MS Word</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьФайлШаблона</Name>
					<Comment>Файл шаблона документа MS Word DOC</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДокумент</Name>
					<Comment>Для документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьАР_ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ТипыДокументовПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ШаблоныДокументов/Ext/ObjectModule.bsl
Процедура ОбновитьДанныеПриПереходеС20() Экспорт
	
	Если ЗначениеЗаполнено(ТипДокумента) Тогда // уже обновляли
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УдалитьДокумент) Тогда
		ТипДокумента = Перечисления.АР_ТипыДокументовПечатныхФорм[СокрЛП(УдалитьДокумент)];
	КонецЕсли;
	Если ЗначениеЗаполнено(УдалитьШаблон) Тогда
		Если ЗначениеЗаполнено(УдалитьШаблон.Хранилище) Тогда
			Хранилище = Новый ХранилищеЗначения(УдалитьШаблон.Хранилище.Получить());
		КонецЕсли;
		ИмяФайла = УдалитьШаблон.ИмяФайла;
	КонецЕсли;
	
КонецПроцедуры
